app/controllers/practitioners_controller.rb

  def index
    @practitioners = Practitioner.all
---
SELECT "practitioners".* FROM "practitioners"

  def create
    @practitioner = Practitioner.new(practitioner_params)

    respond_to do |format|
      if @practitioner.save
---
INSERT INTO "practitioners" ("name", "company", "title", "has_won", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "test1"], ["company", "some company"], ["title", "some title"], ["has_won", false], ["created_at", 2017-04-05 16:36:24 UTC], ["updated_at", 2017-04-05 16:36:24 UTC]]

    def set_practitioner
      @practitioner = Practitioner.find(params[:id])
---
SELECT  "practitioners".* FROM "practitioners" WHERE "practitioners"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]