app/controllers/sponsors_controller.rb

  def index
    @sponsors = Sponsor.all
---
SELECT "sponsors".* FROM "sponsors"

  def create
    @sponsor = Sponsor.new(sponsor_params)

    respond_to do |format|
      if @sponsor.save
---
INSERT INTO "sponsors" ("name", "prizes", "has_won", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "test"], ["prizes", -1], ["has_won", false], ["created_at", 2017-04-05 16:45:45 UTC], ["updated_at", 2017-04-05 16:45:45 UTC]]

  def destroy
    @sponsor.destroy
---
DELETE FROM "sponsors" WHERE "sponsors"."id" = ?  [["id", 1]]

    def set_sponsor
      @sponsor = Sponsor.find(params[:id])
---
SELECT  "sponsors".* FROM "sponsors" WHERE "sponsors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]